# Concatenar DataFrames con concat()

Prepárate para lo que se viene ahora. Vamos a conocer al método `concat()` de  Pandas, que permite unir DataFrames a lo largo de un eje, ya sea vertical u horizontalmente.

Vamos a ver esto en la práctica con los siguientes DataFrames de ejemplo, que tienen la misma estructura, con los mismos nombres de columna, pero con diferentes datos.

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Nombre': ["Juan", "Gabriela", "Elena"], 'Edad': [23, 31, 21]})
df1

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21

In [3]:
df2 = pd.DataFrame({'Nombre': ["Carmela", "Max", "Laura"], 'Edad': [34, 25, 29]})
df2

    Nombre  Edad
0  Carmela    34
1      Max    25
2    Laura    29

En muchas oportunidades vas a tener DataFrames que necesitan agregar nuevos registros que provienen de nuevas tablas que se van agregando con el tiempo. Si quieres agregar la nueva información debajo de la anterior, en un solo DataFrame, cuentas con el método `concat()`, que nos permite poner esas tablas una debajo de la otra, para ir agregando los nuevos registros.

In [4]:
df_cancatenado = pd.concat([df1, df2])
df_cancatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
0   Carmela    34
1       Max    25
2     Laura    29

Por defecto, `concat()` va a agregar los nuevos registros en el eje vertical, porque uno de sus parámetros es `axis` (que significa *EJE*), y viene configurado como `axis=0`, lo que hace que la concatenación se realice sobre el **eje 0**, que es el **eje de las columnas**, pero si cambiamos a `axis=1` (que es el **eje de las filas**), los va a agregar horizontalmente.

In [5]:
df_cancatenado2 = pd.concat([df1, df2], axis=1)
df_cancatenado2

     Nombre  Edad   Nombre  Edad
0      Juan    23  Carmela    34
1  Gabriela    31      Max    25
2     Elena    21    Laura    29

Volvamos al **eje 0**, que es el más común, y observa que el índice de este DataFrame concatenado consiste en los mismos números de índice que tenían los dataframes originales (`0, 1, 2` y `0, 1, 2`).

Puede que tu prefieras que el índice se resetee, y que vaya desde 0 en adelante sin repetirse. Para eso, cuentas con el método `ignore_index()`, que significa *ignorar el índice*, y que si lo cargas como `True`, va a **ignorar los índices originales** y va a **crear un índice nuevo**.

In [6]:
df_cancatenado = pd.concat([df1, df2], ignore_index=True)
df_cancatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
3   Carmela    34
4       Max    25
5     Laura    29

Otro parámetro importante es `keys`, que nos permite agregar marcas para indicar a qué grupo pertenece cada parte del DataFrame.

In [7]:
df_cancatenado = pd.concat([df1, df2], keys=['df1', 'df2'])
df_cancatenado

         Nombre  Edad
df1 0      Juan    23
    1  Gabriela    31
    2     Elena    21
df2 0   Carmela    34
    1       Max    25
    2     Laura    29

Ahora puedo ver con claridad a qué DataFrame pertenecía originalmente cada grupo de datos. Y aún más, aquí podría poner los nombres que a mí me resulten significativos:

In [8]:
df_cancatenado = pd.concat([df1, df2], keys=['enero', 'febrero'])
df_cancatenado

             Nombre  Edad
enero   0      Juan    23
        1  Gabriela    31
        2     Elena    21
febrero 0   Carmela    34
        1       Max    25
        2     Laura    29

Esto ha sido lo más importante sobre `concat()`, y es hora de avanzar.